domande-fatte-orale.org
(ho provato a segnare anche le risposte date, ma provare ad ascoltare cosa dicono e scriverlo contemporaneamente è più difficile del previsto, quindi quanto riportato presenta buchi e male interpolazioni, visto che non so abbastanza sulla materia da riempire i buchi non compresi)
(mi scuso per le battutine del cazzo)
* N
** (roba che non ho segnato)
** Ha chiesto l'FDDI da qualche parte
** S-S-S
 - struttura S-S-S ::
 - analisi di clos per le strutture S-S-S ::
   (si basa sullo studio del caso peggiore, si assume che ... occupati e occupati)
 - dhcp ::
   - cos'è
   - a cosa serve
   - come funziona ::
     il client manda al server la richiesta...
     il server che riceve la richiesta da al client l'indirizzo ip disponibile
     il client sceglie tra gli indirizzi ip quello più vantaggioso in base a varii criteri
     comunica la scelta dell'indirizzo al server
     prima che tale indirizzo appartenga al client è necessaria una conferma finale da parte del server visto che mentre il client sceglie può essere che l'ip l'hanno preso altri

** Come si fa a distinguere una sequenza da un'altra
(numero di sequenza)

** PLS
una tacnica di routing che si basa su...
si associa a più ... una stessa etichetta
l'etichetta è associata al tipo di traffico e ... indirettamente al dispositivo

** Differenza tra routing ... e routing PLS
qualcosa proprio a livello formale che nel routing classico non è proprio possibile
legata a come il PLS lavora, una particolarità che consente di implementare ...

l'abbinamento sorgente destinazione ... è uno solo, nell'NPLS no apputno perchè ...

ha preso 28

* N + 1
** Reti DQDB
le reti dqdb (e disegna l'affare con due bus e tre contatori sulla lavagna)
quando un nodo ... tutti gli altri nodi vengono ... attraverso ... un bus e l'altro bus ...

*** mi fai vedere la struttura interna di un nodo?
e come ...

mi fai però lo schemettino che ...
ok il traffico però l'architettura interna al nodo per gestirlo
 - contatore add drop :: incrementa se p = 1, decrementa se p = 0, conta quanti nodi si sono già prenotati, quando un nodo vuole trasmettere il numero viene passato al drop, quindi è conensso al contatore drop
 - contatore drop :: decrementa se s = 0 e conta quanti nodi hanno priorità rispetto a ...
 - buffer ::

durante il periodo di attesa questo qui che fa, si ferma oppure va a ...   
io prenoto e trasferisco, in attesa che ...

la domanda è semplicemente, durante il periodo di attesa, il contatore drop?
continua a funzionare perchè si deve rispettare l'ordinamento temporale per rispettare la fila d'attesa

*** Inconveniente
è simpatica, è bellina, però ha un'incoveniente, apparentemente sembra ideale, rispetti sempre la priorità...
però purtroppo c'è un problema, che sono privilegiati i nodi più vicini a...

** Il bridge
 - che cos'è
 - come funziona
 - cosa si intende con politica di autoapprendimento

*** autoapprendimento
se l'indirizzo che arriva ... non è già presente nella tabella questa viene aggiornata
salva l'indirizzo su un buffer

il bridge te lo metti e fa da se
all'inizio la memoria è tutta vuota

te nel pacchetto hai un campo sorgente e un campo destinazione, il bridge che fa? non conosce mica la rete, usa il campo sorgente perchè sai che lo ricevi da una porta e ...

** Tecnica spin
- cos'è
- dove si usa
- ...

è una tecnica usata per routing datacenter basata su metadati, questa non è un'informazione completa è per l'apputno una descrizione
uno manda... e pubblicizza il proprio metadato, quelli interessati mandano una richiesta e ... prenotano

quello manda in broadcast e ...

*** Qual'è il problema di questa tecnica?
sembra proprio bellina però ha un inconveniente da sistemare
non tutti i nodi vengono raggiunti dalla pubblicizzazoine, quindi?
la conseguenza di questo? che può succedere? Che se nessuno di quelli vicni è interessato allora ...

questo ha preso 27, è andato bene

* N + 3
(stampelle, potrebbe essersi limitato apposta da domande che richiedessero la lavagna)
** Ci dimostri la formula di lee
rispetto all'analisi di Clos vede il blocco come un evento aleatorio
in questo caso una probabilità di blocco bassa viene accettata, accetta il fatto che possa esserci una condizione di blocco

si chiama \(\alpha\) la probabilità con cui una rete può essere utilizzata ... \(\frac{1}{k}\) ... \(n\) dove \(n\) sarà il numero di linee in ingresso

la probabilità che un'uscita boh sia occupata sarà \(\frac{n \times \alpha}{k}\)
questa analisi non è però precisa, se si inserisce dentro questa formula l'analisi di clos si vede che non prevede una probabilità pari a \(0\)

** Mi parli della frammentazione
introdotta nell'ipv4
prevede il fatto che un pacchetto venga diviso in più pacchetti, che vengono poi enumerati per permettere la ricostruizione del pacchetto

se è connection oriented allora ...

*** Mi dici quali campi del pacchetto sono utilizzati?
qualcosa, quello più importante, che mi sono perso

l'identification che rappresenta l'ordine di sequenza del... nel pacchetto e ...
associa il frammento a un puntatore per poterlo poi

c'è n'è poi un altro, son piuttosto banali, ma se uno non li dice
tra i due uno è più importante dell'altro

c'è un campo che dice se il frammento è l'ultimo della sequenza o no, per poterla finire
e un campo che dice se il frammento può essere ulteriormente frammentato
(ultimi due detti dal fantacci perchè non li sapeva)

c'è un qualcosa che aumenta il ritardo rispetto a quello che potrebbe essere allineandosi in maniera rigorsa quello che hai detto te
il ritardo che tutte le volte che si va a rifare la testata bisogna ricalcolare il checksum

*** Nell'ipv6 come vengono risolti questi problemi?
per avere un'elaborazione più veloce l'header dell'ipv6 è più piccolo
nell'ipv6 la frammentazione c'è o non c'è? c'è, le reti sono sempre quelle
però come viene implementata? Rispetto all'ipv4, in una manienra abbastanza semplice, viene stimata in una maniera end to end per determinare subito la dimensione massima di nodo e poi da lì si va a dritto
(sempre detto dal fantacci perchè lui non lo sapeva)

** Routing boradcast
ci sono varii metodi per farlo
una è avere tante connessioni unicast quanti i nodi della rete, ma bisognerebbe gestire gli stessi pacchetti molte volte
si ha ... tutti gli indirizzi dei nodi della rete, un nodo, letto il pacchetto, lo manda a tutti i nodi associati e ...

ok broadcast vuol dire tutti, tu stai descrivendo il multicast

*** quali sono le tecniche di broadcast?
 - flooding :: mandi a tutti i vicini salvo chi t'ha dato
 - ... :: qualcos'altro ma solo se ... costo minimo

ok qualche piccola incertezza, 28.

* N + 4
** parlami della tecnica aloha
questo parla a voce troppo bassa perchè si capisca cosa sta dicendo
*** con che criterio si sceglie un instante in cui trasmettere
alla cazzo di cane, con probabilità uniforme per massimizzare la cazzo[fn::per diminuire la probabilità che due collidano de novo]
(non lo sapeva)

