domande-fatte-orale.tex
% Created 2023-07-24 Mon 10:56
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Biggie Dickus}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Biggie Dickus},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

(ho provato a segnare anche le risposte date, ma provare ad ascoltare cosa dicono e scriverlo contemporaneamente è più difficile del previsto, quindi quanto riportato presenta buchi e male interpolazioni, visto che non so abbastanza sulla materia da riempire i buchi non compresi)
(mi scuso per le battutine del cazzo)
\section{N}
\label{sec:orgb0a56ea}
\subsection{(roba che non ho segnato)}
\label{sec:org0e64073}
\subsection{Ha chiesto l'FDDI da qualche parte}
\label{sec:orgd771a8f}
\subsection{S-S-S}
\label{sec:org974e669}
\begin{description}
\item[{struttura S-S-S}] 

\item[{analisi di clos per le strutture S-S-S}] (si basa sullo studio del caso peggiore, si assume che \ldots{} occupati e occupati)
\item[{dhcp}] \begin{itemize}
\item cos'è
\item a cosa serve
\item[{come funziona}] il client manda al server la richiesta\ldots{}
il server che riceve la richiesta da al client l'indirizzo ip disponibile
il client sceglie tra gli indirizzi ip quello più vantaggioso in base a varii criteri
comunica la scelta dell'indirizzo al server
prima che tale indirizzo appartenga al client è necessaria una conferma finale da parte del server visto che mentre il client sceglie può essere che l'ip l'hanno preso altri
\end{itemize}
\end{description}

\subsection{Come si fa a distinguere una sequenza da un'altra}
\label{sec:org1d6e7ae}
(numero di sequenza)

\subsection{PLS}
\label{sec:org75e07d2}
una tacnica di routing che si basa su\ldots{}
si associa a più \ldots{} una stessa etichetta
l'etichetta è associata al tipo di traffico e \ldots{} indirettamente al dispositivo

\subsection{Differenza tra routing \ldots{} e routing PLS}
\label{sec:orgc85e4e5}
qualcosa proprio a livello formale che nel routing classico non è proprio possibile
legata a come il PLS lavora, una particolarità che consente di implementare \ldots{}

l'abbinamento sorgente destinazione \ldots{} è uno solo, nell'NPLS no apputno perchè \ldots{}

ha preso 28

\section{N + 1}
\label{sec:org5e534ad}
\subsection{Reti DQDB}
\label{sec:org710ca01}
le reti dqdb (e disegna l'affare con due bus e tre contatori sulla lavagna)
quando un nodo \ldots{} tutti gli altri nodi vengono \ldots{} attraverso \ldots{} un bus e l'altro bus \ldots{}

\subsubsection{mi fai vedere la struttura interna di un nodo?}
\label{sec:orged3199e}
e come \ldots{}

mi fai però lo schemettino che \ldots{}
ok il traffico però l'architettura interna al nodo per gestirlo
\begin{description}
\item[{contatore add drop}] incrementa se p = 1, decrementa se p = 0, conta quanti nodi si sono già prenotati, quando un nodo vuole trasmettere il numero viene passato al drop, quindi è conensso al contatore drop
\item[{contatore drop}] decrementa se s = 0 e conta quanti nodi hanno priorità rispetto a \ldots{}
\item[{buffer}] 
\end{description}

durante il periodo di attesa questo qui che fa, si ferma oppure va a \ldots{}   
io prenoto e trasferisco, in attesa che \ldots{}

la domanda è semplicemente, durante il periodo di attesa, il contatore drop?
continua a funzionare perchè si deve rispettare l'ordinamento temporale per rispettare la fila d'attesa

\subsubsection{Inconveniente}
\label{sec:org3f6c7af}
è simpatica, è bellina, però ha un'incoveniente, apparentemente sembra ideale, rispetti sempre la priorità\ldots{}
però purtroppo c'è un problema, che sono privilegiati i nodi più vicini a\ldots{}

\subsection{Il bridge}
\label{sec:org7c59af0}
\begin{itemize}
\item che cos'è
\item come funziona
\item cosa si intende con politica di autoapprendimento
\end{itemize}

\subsubsection{autoapprendimento}
\label{sec:org88cdd48}
se l'indirizzo che arriva \ldots{} non è già presente nella tabella questa viene aggiornata
salva l'indirizzo su un buffer

il bridge te lo metti e fa da se
all'inizio la memoria è tutta vuota

te nel pacchetto hai un campo sorgente e un campo destinazione, il bridge che fa? non conosce mica la rete, usa il campo sorgente perchè sai che lo ricevi da una porta e \ldots{}

\subsection{Tecnica spin}
\label{sec:org652bd92}
\begin{itemize}
\item cos'è
\item dove si usa
\item \ldots{}
\end{itemize}

è una tecnica usata per routing datacenter basata su metadati, questa non è un'informazione completa è per l'apputno una descrizione
uno manda\ldots{} e pubblicizza il proprio metadato, quelli interessati mandano una richiesta e \ldots{} prenotano

quello manda in broadcast e \ldots{}

\subsubsection{Qual'è il problema di questa tecnica?}
\label{sec:orgcc9fd8b}
sembra proprio bellina però ha un inconveniente da sistemare
non tutti i nodi vengono raggiunti dalla pubblicizzazoine, quindi?
la conseguenza di questo? che può succedere? Che se nessuno di quelli vicni è interessato allora \ldots{}

questo ha preso 27, è andato bene

\section{N + 3}
\label{sec:org1774da4}
(stampelle, potrebbe essersi limitato apposta da domande che richiedessero la lavagna)
\subsection{Ci dimostri la formula di lee}
\label{sec:orgb61171f}
rispetto all'analisi di Clos vede il blocco come un evento aleatorio
in questo caso una probabilità di blocco bassa viene accettata, accetta il fatto che possa esserci una condizione di blocco

si chiama \(\alpha\) la probabilità con cui una rete può essere utilizzata \ldots{} \(\frac{1}{k}\) \ldots{} \(n\) dove \(n\) sarà il numero di linee in ingresso

la probabilità che un'uscita boh sia occupata sarà \(\frac{n \times \alpha}{k}\)
questa analisi non è però precisa, se si inserisce dentro questa formula l'analisi di clos si vede che non prevede una probabilità pari a \(0\)

\subsection{Mi parli della frammentazione}
\label{sec:org844d3ad}
introdotta nell'ipv4
prevede il fatto che un pacchetto venga diviso in più pacchetti, che vengono poi enumerati per permettere la ricostruizione del pacchetto

se è connection oriented allora \ldots{}

\subsubsection{Mi dici quali campi del pacchetto sono utilizzati?}
\label{sec:orgd68bfd3}
qualcosa, quello più importante, che mi sono perso

l'identification che rappresenta l'ordine di sequenza del\ldots{} nel pacchetto e \ldots{}
associa il frammento a un puntatore per poterlo poi

c'è n'è poi un altro, son piuttosto banali, ma se uno non li dice
tra i due uno è più importante dell'altro

c'è un campo che dice se il frammento è l'ultimo della sequenza o no, per poterla finire
e un campo che dice se il frammento può essere ulteriormente frammentato
(ultimi due detti dal fantacci perchè non li sapeva)

c'è un qualcosa che aumenta il ritardo rispetto a quello che potrebbe essere allineandosi in maniera rigorsa quello che hai detto te
il ritardo che tutte le volte che si va a rifare la testata bisogna ricalcolare il checksum

\subsubsection{Nell'ipv6 come vengono risolti questi problemi?}
\label{sec:org4ea0d3d}
per avere un'elaborazione più veloce l'header dell'ipv6 è più piccolo
nell'ipv6 la frammentazione c'è o non c'è? c'è, le reti sono sempre quelle
però come viene implementata? Rispetto all'ipv4, in una manienra abbastanza semplice, viene stimata in una maniera end to end per determinare subito la dimensione massima di nodo e poi da lì si va a dritto
(sempre detto dal fantacci perchè lui non lo sapeva)

\subsection{Routing boradcast}
\label{sec:org27d3389}
ci sono varii metodi per farlo
una è avere tante connessioni unicast quanti i nodi della rete, ma bisognerebbe gestire gli stessi pacchetti molte volte
si ha \ldots{} tutti gli indirizzi dei nodi della rete, un nodo, letto il pacchetto, lo manda a tutti i nodi associati e \ldots{}

ok broadcast vuol dire tutti, tu stai descrivendo il multicast

\subsubsection{quali sono le tecniche di broadcast?}
\label{sec:org2d38312}
\begin{description}
\item[{flooding}] mandi a tutti i vicini salvo chi t'ha dato
\item[{\ldots{}}] qualcos'altro ma solo se \ldots{} costo minimo
\end{description}

ok qualche piccola incertezza, 28.

\section{N + 4}
\label{sec:org9cbba23}
\subsection{parlami della tecnica aloha}
\label{sec:orgee1c1d9}
questo parla a voce troppo bassa perchè si capisca cosa sta dicendo
\subsubsection{con che criterio si sceglie un instante in cui trasmettere}
\label{sec:orgc9a158e}
alla cazzo di cane, con probabilità uniforme per massimizzare la cazzo\footnote{per diminuire la probabilità che due collidano de novo}
(non lo sapeva)
