domande-fatte-orale.org
*** Ci sono due varianti, perchè lo slotted è meglio
e cos'è che evita lo slotted che invece nell'aloha classico...
diventa più piccolo, infatti qual'è l'evento che si esclude

in questo modo cos'è che eviti che succeda, eviti che ..., visto che saranno tutti allineati se vinci in quel momento vinci sempre
(non lo sapeva)

** Il conteggi all'infinito, che cos'è
il problema del conteggio all'infinito nasce quando si devono aggiornare le tabelle di routing con il meotodo di...
(silezio abissale)
con il metodo distance vector (detta dal fantacci)

** Sicurezza a chiave pubblica
L'RSA, l'RSA è figo
*** come funziona dal punto di vista di procedura?
proprio al livello di funzionamento a macrolivello

se due entità A e B vogliono parlare tra di loro A deve prendere la chiave pubblica di B
non l'algoritmo,
(non basta conoscere la chiave pubblica non si riesce a decifrare il messaggio perchè servono anche infromazioni dalla chiave privata che ...)
(anche questa non lo sapeva)

* N + 5
(comincia cancellando la lavagna, promettente)
(parla molto in fretta, elevato package loss)
** Problema del terminale esposto, e come viene risolto
intanto siamo nell'ambito delle reti wireless
il problema del terminale esposto è innanzitutto da ricondurre alla soluzoine del problema del terminale nascosto

(diagramma eulero venn con i raggi di a, b, c, d)
a parla con B e fa l'handshake
il messaggio viene ricevuto da tutti i nodi nel raggio di A
questo imposta tutti i valori di NAV nell raggio di A, quindi anche quello di B

(inizia a non tornarmi la nomenclatura, sta confondendo un minimo B con C mi sa)
(mette che A può dialogare con C)
(ok corregge la nomenclatura)

quindi D è il terminale esposto

*** Ok, e come si risolve?
una strategia più che per risolverlo è che per mitigarlo è il ... off
una soluzoine alla radice cosa potrebbe essere? si è detto a lezione e sul libro
non c'è una soluzione alla radice

** Tecnica diffuzion boh
usata nelle reti di sensori
associa a ogni ... una coppia attributo valore
trasmessa con tecnica flooding
cosa viene inviato, spesso una lista di attributo valore

inizia con manifestazione di interesse da parte del mittente
poi ... gradient per ...
raccolta dato da parte del sensore lungo il percorso scleto dal ... gradiente
poi reinforcement, si usa per uno scopo ben preciso, non il rate della trasmissione, c'è una ragione molto pratica per cui il nodo sink fa reinforcement
perchè in questo modo ne sceglie una tra tutte così gli altri non...

** Sliding window
tutto è architettato sulla base del numero di sequenza, anche per il numero di riscontro
vado a definire una \(wl\) o /window lenght/, quanti pacchetti possono essere mandati di fila
entro la finestra deve essere stato mandato il riscontro del primo pacchetto della finestra
quando il riscontro del primo pacchetto avviene per tempo allora non siamo in uno stato di congestione
quando non è per tempo siamo in uno stato di congestione, la finestra viene chiusa e sarà riaperta quando arriva il pacchetto

ogni volta che ... si va ad aumentare di uno la lughezza della finestra, questo per testare la rete fino a quando non arriva una ... di congestione
poi si prende un valore che è la metà esatta del valore che ha creato la congestione e poi si va nella fase di congestion avoidance
(il fantacci c'ha na faccia mo' proprio)

...
si va a scegliere una lughezza della finestra di valore pari alla metà del... questo va bene, poi
poi si va ad inviare i pacchetti, ma con che procedura, si riinizializza la finestra a 1, e quando si arriva al valore target determinato come metà del valore di congestione è lì che parte il meccanismo di congestion avoidance

27, è andato bene

* N + 5
(mancato)

* N + 6
** Strutture di commutazione a divisione di tempo
come sono fatte
qual'è il costo
...

le strutture a commutazione a divisione di tempo, chiamate strutture \(T\), sono un tipo di struttura di commutazine, poi ci sono quelle \(S\)
sono implementate con delle memorie
sono utilizzate soltanto nella telefonia numerica e permettono la permutazione di canale
in un tempo di trama, fissato per convenzione a \(125 \mu s\)
questo poi va diviso per \(2n\), con \(n\) numero di trame, (visto che accesso sia in lettura che scrittura per ognuno)
il tempo di \(125 \mu s\) è scelto perchè bla bla bla campionamento shannon

 - scrittura casuale lettura sequenziale
 - scruttura sequenziale lettura casuale

(si usa /casuale/ perchè potrebbe essere qualsiasi ordine)

** Congestion Avoidance
è una tecnica reattiva della sliding window
... quando si è a una dimensione matura della rete, a differenza dello slow start, invece di aumentare esponenzialmente la dimensione della finsestra (=std::vecotr= time)
si va in maniera più prudente per ...

*** che alternative si hanno?
possiamo reiniziare con un altro slow start per ...

** Conteggio all'infinito
il conteggio all'infinito è un problema che si crea nell'algoritmo di distance vector quando un ... non esiste più tra due host
l'host ...
il collegamento tra \(B\) e \(C\) non esiste più
ma \(A\), collegato a \(B\), e che usa \(B\) per arrivare a \(C\), manda a \(B\) il fatto che "hey ci arrivo con \(AB + BC\)", \(B\), che pensa quel valore non lo riguardi, se lo salva.
poi quando rimanda il valore ad \(A\) allora \(A\) incrementa il suo costo per \(C\), lo rimana a \(B\), che poi lo manda ad \(A\) che incrementa il suo costo per \(C\), che al mercato mio padre comprò

*** Soluzoini
- infinito finito
- split horizon
- ...
...
quello non basta, ci vuole qualcosa di più a monte.
si evita di mandare dei cammini che si sa saranno attivati partendo dal nodo a cui si vuole mandare...
quidni qui \(A\) non manderà a \(B\) niente che riguardi \(C\), questo è un metodo, e l'altra

questa tecnica apparentemente risolve tutto, ma c'è un inghippo per come in questa rete si gestisce l'aggiornamento

può darsi che una rotta sia ancora considerata valida e ...

se non c'ho nulla entro un tempo si assume che il nodo non faccia più parte della rete
l'ultima variante cosa fa per risolvere questo problema? Il nodo manda ... per rinfrescare il collegamento e mantenerlo attivo

30 vai

* N + 7
il veterano
** Parlami delle tecniche ADSL
le tecniche di adsl sono tecniche utilizzate per il trasferimento di dati di più tipologie
 - ci sono quelle simmetriche :: tengono la stessa banda per upload e download
 - ci sono quelle asimmetriche :: con una preferenza per il download, o per l'upload
   - la preferenza per il *download* è più per *roba domestica*
   - per i *server e roba* a cui si richiede tante cose c'è più in *upload*

come si fa ... con il coso di rame dial up
il coso di rame ... una direzione alla volta
... telefonia numerica ...

questa tecnica è ...
però in ricezoine come si fa a dividere parte utente da...
si fa con un filtro passa basso e con un filtro passa alto

l'adsl ha la caratteristica, un po' più tecnica, di dare velocità più alta a ... perchè adatta la modulazione ... canale

