domande-fatte-orale.tex

\subsubsection{Ci sono due varianti, perchè lo slotted è meglio}
\label{sec:org5931e0d}
e cos'è che evita lo slotted che invece nell'aloha classico\ldots{}
diventa più piccolo, infatti qual'è l'evento che si esclude

in questo modo cos'è che eviti che succeda, eviti che \ldots{}, visto che saranno tutti allineati se vinci in quel momento vinci sempre
(non lo sapeva)

\subsection{Il conteggi all'infinito, che cos'è}
\label{sec:orga8105b1}
il problema del conteggio all'infinito nasce quando si devono aggiornare le tabelle di routing con il meotodo di\ldots{}
(silezio abissale)
con il metodo distance vector (detta dal fantacci)

\subsection{Sicurezza a chiave pubblica}
\label{sec:org72024e3}
L'RSA, l'RSA è figo
\subsubsection{come funziona dal punto di vista di procedura?}
\label{sec:org389c937}
proprio al livello di funzionamento a macrolivello

se due entità A e B vogliono parlare tra di loro A deve prendere la chiave pubblica di B
non l'algoritmo,
(non basta conoscere la chiave pubblica non si riesce a decifrare il messaggio perchè servono anche infromazioni dalla chiave privata che \ldots{})
(anche questa non lo sapeva)

\section{N + 5}
\label{sec:org8ebfb59}
(comincia cancellando la lavagna, promettente)
(parla molto in fretta, elevato package loss)
\subsection{Problema del terminale esposto, e come viene risolto}
\label{sec:orgb6282a2}
intanto siamo nell'ambito delle reti wireless
il problema del terminale esposto è innanzitutto da ricondurre alla soluzoine del problema del terminale nascosto

(diagramma eulero venn con i raggi di a, b, c, d)
a parla con B e fa l'handshake
il messaggio viene ricevuto da tutti i nodi nel raggio di A
questo imposta tutti i valori di NAV nell raggio di A, quindi anche quello di B

(inizia a non tornarmi la nomenclatura, sta confondendo un minimo B con C mi sa)
(mette che A può dialogare con C)
(ok corregge la nomenclatura)

quindi D è il terminale esposto

\subsubsection{Ok, e come si risolve?}
\label{sec:org2593333}
una strategia più che per risolverlo è che per mitigarlo è il \ldots{} off
una soluzoine alla radice cosa potrebbe essere? si è detto a lezione e sul libro
non c'è una soluzione alla radice

\subsection{Tecnica diffuzion boh}
\label{sec:org72fcea8}
usata nelle reti di sensori
associa a ogni \ldots{} una coppia attributo valore
trasmessa con tecnica flooding
cosa viene inviato, spesso una lista di attributo valore

inizia con manifestazione di interesse da parte del mittente
poi \ldots{} gradient per \ldots{}
raccolta dato da parte del sensore lungo il percorso scleto dal \ldots{} gradiente
poi reinforcement, si usa per uno scopo ben preciso, non il rate della trasmissione, c'è una ragione molto pratica per cui il nodo sink fa reinforcement
perchè in questo modo ne sceglie una tra tutte così gli altri non\ldots{}

\subsection{Sliding window}
\label{sec:org65e2d83}
tutto è architettato sulla base del numero di sequenza, anche per il numero di riscontro
vado a definire una \(wl\) o \emph{window lenght}, quanti pacchetti possono essere mandati di fila
entro la finestra deve essere stato mandato il riscontro del primo pacchetto della finestra
quando il riscontro del primo pacchetto avviene per tempo allora non siamo in uno stato di congestione
quando non è per tempo siamo in uno stato di congestione, la finestra viene chiusa e sarà riaperta quando arriva il pacchetto

ogni volta che \ldots{} si va ad aumentare di uno la lughezza della finestra, questo per testare la rete fino a quando non arriva una \ldots{} di congestione
poi si prende un valore che è la metà esatta del valore che ha creato la congestione e poi si va nella fase di congestion avoidance
(il fantacci c'ha na faccia mo' proprio)

\ldots{}
si va a scegliere una lughezza della finestra di valore pari alla metà del\ldots{} questo va bene, poi
poi si va ad inviare i pacchetti, ma con che procedura, si riinizializza la finestra a 1, e quando si arriva al valore target determinato come metà del valore di congestione è lì che parte il meccanismo di congestion avoidance

27, è andato bene

\section{N + 5}
\label{sec:orgf2b0513}
(mancato)

\section{N + 6}
\label{sec:org9cc9893}
\subsection{Strutture di commutazione a divisione di tempo}
\label{sec:orgc8699a6}
come sono fatte
qual'è il costo
\ldots{}

le strutture a commutazione a divisione di tempo, chiamate strutture \(T\), sono un tipo di struttura di commutazine, poi ci sono quelle \(S\)
sono implementate con delle memorie
sono utilizzate soltanto nella telefonia numerica e permettono la permutazione di canale
in un tempo di trama, fissato per convenzione a \(125 \mu s\)
questo poi va diviso per \(2n\), con \(n\) numero di trame, (visto che accesso sia in lettura che scrittura per ognuno)
il tempo di \(125 \mu s\) è scelto perchè bla bla bla campionamento shannon

\begin{itemize}
\item scrittura casuale lettura sequenziale
\item scruttura sequenziale lettura casuale
\end{itemize}

(si usa \emph{casuale} perchè potrebbe essere qualsiasi ordine)

\subsection{Congestion Avoidance}
\label{sec:org0e12a9c}
è una tecnica reattiva della sliding window
\ldots{} quando si è a una dimensione matura della rete, a differenza dello slow start, invece di aumentare esponenzialmente la dimensione della finsestra (\texttt{std::vecotr} time)
si va in maniera più prudente per \ldots{}

\subsubsection{che alternative si hanno?}
\label{sec:orge45b3a8}
possiamo reiniziare con un altro slow start per \ldots{}

\subsection{Conteggio all'infinito}
\label{sec:orgb03c701}
il conteggio all'infinito è un problema che si crea nell'algoritmo di distance vector quando un \ldots{} non esiste più tra due host
l'host \ldots{}
il collegamento tra \(B\) e \(C\) non esiste più
ma \(A\), collegato a \(B\), e che usa \(B\) per arrivare a \(C\), manda a \(B\) il fatto che "hey ci arrivo con \(AB + BC\)", \(B\), che pensa quel valore non lo riguardi, se lo salva.
poi quando rimanda il valore ad \(A\) allora \(A\) incrementa il suo costo per \(C\), lo rimana a \(B\), che poi lo manda ad \(A\) che incrementa il suo costo per \(C\), che al mercato mio padre comprò

\subsubsection{Soluzoini}
\label{sec:orgbaf5541}
\begin{itemize}
\item infinito finito
\item split horizon
\item \ldots{}
\end{itemize}
\ldots{}
quello non basta, ci vuole qualcosa di più a monte.
si evita di mandare dei cammini che si sa saranno attivati partendo dal nodo a cui si vuole mandare\ldots{}
quidni qui \(A\) non manderà a \(B\) niente che riguardi \(C\), questo è un metodo, e l'altra

questa tecnica apparentemente risolve tutto, ma c'è un inghippo per come in questa rete si gestisce l'aggiornamento

può darsi che una rotta sia ancora considerata valida e \ldots{}

se non c'ho nulla entro un tempo si assume che il nodo non faccia più parte della rete
l'ultima variante cosa fa per risolvere questo problema? Il nodo manda \ldots{} per rinfrescare il collegamento e mantenerlo attivo

30 vai

\section{N + 7}
\label{sec:org46c4c03}
il veterano
\subsection{Parlami delle tecniche ADSL}
\label{sec:orgc7e1978}
le tecniche di adsl sono tecniche utilizzate per il trasferimento di dati di più tipologie
\begin{description}
\item[{ci sono quelle simmetriche}] tengono la stessa banda per upload e download
\item[{ci sono quelle asimmetriche}] con una preferenza per il download, o per l'upload
\begin{itemize}
\item la preferenza per il \textbf{download} è più per \textbf{roba domestica}
\item per i \textbf{server e roba} a cui si richiede tante cose c'è più in \textbf{upload}
\end{itemize}
\end{description}

come si fa \ldots{} con il coso di rame dial up
il coso di rame \ldots{} una direzione alla volta
\ldots{} telefonia numerica \ldots{}

questa tecnica è \ldots{}
però in ricezoine come si fa a dividere parte utente da\ldots{}
si fa con un filtro passa basso e con un filtro passa alto

l'adsl ha la caratteristica, un po' più tecnica, di dare velocità più alta a \ldots{} perchè adatta la modulazione \ldots{} canale
