domande-fatte-orale.org
** Nat, a che serve, come funziona
ho delle lan con un indirizzo
un nat serve a specificare a quele dispositivo

serve a installare con una connessione da questo a questo senza passare da intenret
ed esporre la lan a internet con una tecnica (...)

serve ad aggregare più utenti con un solo indirizzo ip
normalmente non ci sono conflitti, ma metti ho con lo stesso numero di porta indicato da due...
il nat ha una tabella interna e boh

il router nat va a scegliersi una tabella di routing interna associandola a boh.
quando ... ricostruisce il datagramma corretto e lo manda a quello giusto

** Tecniche polling
non so cosa cazzo ha detto ma il fantacci si è tolto gli occhiali in modo drammatico

ha preso 22

* N + 8
** Strutture di commutazione S-S
sono delle strutture omogenee
consentono il cambio di linea
 - si partizionano le linee di ingresso in più blocchi con lo stesso nuemero di ingressi
 - si partizionano le lineee di uscita in più blocchi con lo stesso numero di uscite

 - la seconda del primo (ingresso) viene collegata alla prima del secondo (uscita) e così via

*** Bloccaggine
sono bloccanti
per renderle non bloccanti ogni nodo di quelli in ingresso dovrebbe avere tante uscite quante quelle della rete

descrivi quando nasce il blocco e poi dimmi come si fa ad evitare
(qualche incertezza nell'esposizione di questo punto)

** Router generalizzato
...

si suddividono in due famiglie
 - senza tabella :: flooding et al
 - con tabella :: tecniche
   - statiche :: ...
   - dinamiche :: ...

e invece il fantacci stava parlando delle sdn, software d(?) network
il routing gnenralizzato consiste nell'instradamento e ... di pacchetti
aspe' questo non è ... questo è come è struttrata la rete

il routing generalizzato è a livello più basso, perchè si chiama generalizzato
perchè si va a fare il routing non solo con la coppia sorgente destinazione, ma anche valori in altri campi, tipo al livello tcp
per fare ad esempio routing in modo diverso per divesi tipi di traffico 
si va ad aumentare i campi da leggere e da processare

** Tecnica (dip)?
dinamica
"imparentata" con il distance vecotr
usa come valore di irrangiugibilità il numero 15

come metrica per il costo dei singoli collegamenti usa il numero di ...

25
(ci pensa)

* N + 9
** Reti FDDI
hanno connessioni su bus
sono entrambi direzionali

quella principale è quella esterna
quella interana è di backup e/o per aumentare la banda

c'è il token, ci sono contatori

partiamo dall'inizio, per funzionare qui si va a definire un parametro di riferimento,
il =Token Target Rotaton Time=

il valore effettivo sarà maggiore o ugugale del tempo target, torvato questo valore come si usa per gestire l'accesso
tieni il token e mandi il token e ...

per arrivare a ... il nodo deve ... alcune operazioni perliminari
cosare il tempo effettivo per ... cosare

si va a calcolare il =Token Holding Time=, il tempo per cui è concesso tenere il token
se ... è maggiore del tempo che ci vuole a ... può mandare anche asincrona
altrimenti il tempo di riferimento sarà solo ... in maniera sincrona

** Tecnica token bucket
utilizzata sempre per l'accesso oridnato al canale e ...

cos'è innanzitutto, è una tecnica per la prevenzione delle congestioni
 - si ha un buffer, il token bucket
 - e un altro buffer, i pacchetti da mandare

così si tengono i permessi del nodo per mandare la roba che manda
che parametro controlla, il rate.
il rate è una variabile aleatoria, questa tecnica quale aspetto del rate tiene costante (va a controllare il rate medio)

** Maschera di rete
una maschera di rete serve a indicare quali bit sono per l'indirizzo della rete e quali bit sono per l'indirizzo dell'host
nella maschera viene dato un ulteriore numero e ...

il router come fa per scoprirlo? (mi sono perso questa parte)

24

* N + 10
(package lost)

* N + 11
** Strutture di commutazoine S-T
sono strutture di commutazione non omogenee
in genrale queste strutture permetono sia un cambio di canale all'interno della stessa linea che un cambio di linea

per risolvere questo problema di blocco si usano strutture a tre stadii, come la T-S-T o la S-T-S

*** Problema di blocco
il blocco succede quando ho due linee da due canali di ingresso che vogliono andare su due canali diversi della stessa linea di uscita

** Accesso ordinato
a livello MAC
 - Roll Call :: il master ha una lista, questa può essere utilizzata per tipologie a stella
 - Hub Polling :: per tipologie a bus, il master, a un estremo del bus di solito. manda un ... all'ultimo nel bus, e questo lo porta indietro

*** Tipi di accesso
 - gated :: si ha un tempo massimo, se hai pacchetti da mandare dopo quel tempo aspetti
 - esaustivo :: il nodo può trasmettere quanto vuole finchè non ha finito i pacchetti

e questo tempo gated come viene definito?
durante una fase di setup della rete? NO
è un tempo casuale che dipede da varii parametri relativi al nodo e alla rete

** Tecniche Clustering
utilizzato nelle reti di sensori per rendere le reti di sensori più efficienti
 - leach :: =low energy adaptive clustering hierarchy=
   si ha un capo cluster...
   in generale qui tutti devo essere connessi al sink in quanto devono poter essere tutti capo cluster
   il problema con queste ...
   non mirata all'energia
 - HEED :: Hyprid Energy Efficient Distributed Clustering
   ...

   ti do un voto che in genere non do mai, 29

* N + 12
(di elettronica e automazione)
** Formula di Clos e ottimizzazoine del costo
si calcola il numero di blocchi ... del secondo stadio

* N + 13
* N + 14
* N + 15
* N + 16

   



   




  

