domande-fatte-orale.tex

\subsection{Nat, a che serve, come funziona}
\label{sec:org9c6d4f7}
ho delle lan con un indirizzo
un nat serve a specificare a quele dispositivo

serve a installare con una connessione da questo a questo senza passare da intenret
ed esporre la lan a internet con una tecnica (\ldots{})

serve ad aggregare più utenti con un solo indirizzo ip
normalmente non ci sono conflitti, ma metti ho con lo stesso numero di porta indicato da due\ldots{}
il nat ha una tabella interna e boh

il router nat va a scegliersi una tabella di routing interna associandola a boh.
quando \ldots{} ricostruisce il datagramma corretto e lo manda a quello giusto

\subsection{Tecniche polling}
\label{sec:org7bcb77f}
non so cosa cazzo ha detto ma il fantacci si è tolto gli occhiali in modo drammatico

ha preso 22

\section{N + 8}
\label{sec:org336a159}
\subsection{Strutture di commutazione S-S}
\label{sec:orgb14c6a4}
sono delle strutture omogenee
consentono il cambio di linea
\begin{itemize}
\item si partizionano le linee di ingresso in più blocchi con lo stesso nuemero di ingressi
\item si partizionano le lineee di uscita in più blocchi con lo stesso numero di uscite

\item la seconda del primo (ingresso) viene collegata alla prima del secondo (uscita) e così via
\end{itemize}

\subsubsection{Bloccaggine}
\label{sec:org3b614bc}
sono bloccanti
per renderle non bloccanti ogni nodo di quelli in ingresso dovrebbe avere tante uscite quante quelle della rete

descrivi quando nasce il blocco e poi dimmi come si fa ad evitare
(qualche incertezza nell'esposizione di questo punto)

\subsection{Router generalizzato}
\label{sec:orgdcb2b36}
\ldots{}

si suddividono in due famiglie
\begin{description}
\item[{senza tabella}] flooding et al
\item[{con tabella}] tecniche
\begin{description}
\item[{statiche}] \ldots{}
\item[{dinamiche}] \ldots{}
\end{description}
\end{description}

e invece il fantacci stava parlando delle sdn, software d(?) network
il routing gnenralizzato consiste nell'instradamento e \ldots{} di pacchetti
aspe' questo non è \ldots{} questo è come è struttrata la rete

il routing generalizzato è a livello più basso, perchè si chiama generalizzato
perchè si va a fare il routing non solo con la coppia sorgente destinazione, ma anche valori in altri campi, tipo al livello tcp
per fare ad esempio routing in modo diverso per divesi tipi di traffico 
si va ad aumentare i campi da leggere e da processare

\subsection{Tecnica (dip)?}
\label{sec:org91284e1}
dinamica
"imparentata" con il distance vecotr
usa come valore di irrangiugibilità il numero 15

come metrica per il costo dei singoli collegamenti usa il numero di \ldots{}

25
(ci pensa)

\section{N + 9}
\label{sec:orgcf17fc6}
\subsection{Reti FDDI}
\label{sec:orgce05e97}
hanno connessioni su bus
sono entrambi direzionali

quella principale è quella esterna
quella interana è di backup e/o per aumentare la banda

c'è il token, ci sono contatori

partiamo dall'inizio, per funzionare qui si va a definire un parametro di riferimento,
il \texttt{Token Target Rotaton Time}

il valore effettivo sarà maggiore o ugugale del tempo target, torvato questo valore come si usa per gestire l'accesso
tieni il token e mandi il token e \ldots{}

per arrivare a \ldots{} il nodo deve \ldots{} alcune operazioni perliminari
cosare il tempo effettivo per \ldots{} cosare

si va a calcolare il \texttt{Token Holding Time}, il tempo per cui è concesso tenere il token
se \ldots{} è maggiore del tempo che ci vuole a \ldots{} può mandare anche asincrona
altrimenti il tempo di riferimento sarà solo \ldots{} in maniera sincrona

\subsection{Tecnica token bucket}
\label{sec:orgb15be9b}
utilizzata sempre per l'accesso oridnato al canale e \ldots{}

cos'è innanzitutto, è una tecnica per la prevenzione delle congestioni
\begin{itemize}
\item si ha un buffer, il token bucket
\item e un altro buffer, i pacchetti da mandare
\end{itemize}

così si tengono i permessi del nodo per mandare la roba che manda
che parametro controlla, il rate.
il rate è una variabile aleatoria, questa tecnica quale aspetto del rate tiene costante (va a controllare il rate medio)

\subsection{Maschera di rete}
\label{sec:orgb3e596a}
una maschera di rete serve a indicare quali bit sono per l'indirizzo della rete e quali bit sono per l'indirizzo dell'host
nella maschera viene dato un ulteriore numero e \ldots{}

il router come fa per scoprirlo? (mi sono perso questa parte)

24

\section{N + 10}
\label{sec:org74378ba}
(package lost)

\section{N + 11}
\label{sec:org507c258}
\subsection{Strutture di commutazoine S-T}
\label{sec:orgc6c4013}
sono strutture di commutazione non omogenee
in genrale queste strutture permetono sia un cambio di canale all'interno della stessa linea che un cambio di linea

per risolvere questo problema di blocco si usano strutture a tre stadii, come la T-S-T o la S-T-S

\subsubsection{Problema di blocco}
\label{sec:org03d61fc}
il blocco succede quando ho due linee da due canali di ingresso che vogliono andare su due canali diversi della stessa linea di uscita

\subsection{Accesso ordinato}
\label{sec:org9097783}
a livello MAC
\begin{description}
\item[{Roll Call}] il master ha una lista, questa può essere utilizzata per tipologie a stella
\item[{Hub Polling}] per tipologie a bus, il master, a un estremo del bus di solito. manda un \ldots{} all'ultimo nel bus, e questo lo porta indietro
\end{description}

\subsubsection{Tipi di accesso}
\label{sec:orgc667083}
\begin{description}
\item[{gated}] si ha un tempo massimo, se hai pacchetti da mandare dopo quel tempo aspetti
\item[{esaustivo}] il nodo può trasmettere quanto vuole finchè non ha finito i pacchetti
\end{description}

e questo tempo gated come viene definito?
durante una fase di setup della rete? NO
è un tempo casuale che dipede da varii parametri relativi al nodo e alla rete

\subsection{Tecniche Clustering}
\label{sec:orga89de51}
utilizzato nelle reti di sensori per rendere le reti di sensori più efficienti
\begin{description}
\item[{leach}] \texttt{low energy adaptive clustering hierarchy}
si ha un capo cluster\ldots{}
in generale qui tutti devo essere connessi al sink in quanto devono poter essere tutti capo cluster
il problema con queste \ldots{}
non mirata all'energia
\item[{HEED}] Hyprid Energy Efficient Distributed Clustering
\ldots{}

ti do un voto che in genere non do mai, 29
\end{description}

\section{N + 12}
\label{sec:org0490377}
(di elettronica e automazione)
\subsection{Formula di Clos e ottimizzazoine del costo}
\label{sec:orgb07d826}
si calcola il numero di blocchi \ldots{} del secondo stadio

\section{N + 13}
\label{sec:orgb2e5eb0}
\section{N + 14}
\label{sec:orgefbb3ee}
\section{N + 15}
\label{sec:orgb59038f}
\section{N + 16}
\label{sec:org2d695a6}
\end{document}